In [1]:
import pandas as pd

In [7]:
# 인공지능 반과 빅데이터 반에 취업 진로를 데이터 프레임으로 만들어보자
# 빅데이터 반
df_big = pd.DataFrame([['빅데이터분석가', 6],
                     ['자영업', 7],
                     ['웹개발자', 4],
                     ['대학원', 3],
                     ['합계', 20]],
                     columns = ['빅데진로희망', '빅데도수'])
df_big

    빅데진로희망  빅데도수
0  빅데이터분석가     6
1      자영업     7
2     웹개발자     4
3      대학원     3
4       합계    20

In [8]:
df_ai = pd.DataFrame([['빅데이터분석가', 12],
                     ['자영업', 14],
                     ['웹개발자', 10],
                     ['대학원', 14],
                     ['합계', 50]],
                     columns = ['인공진로희망', '인공도수'])
df_ai

    인공진로희망  인공도수
0  빅데이터분석가    12
1      자영업    14
2     웹개발자    10
3      대학원    14
4       합계    50

In [10]:
df_all = pd.concat([df_big, df_ai['인공도수']], axis = 1)
df_all

    빅데진로희망  빅데도수  인공도수
0  빅데이터분석가     6    12
1      자영업     7    14
2     웹개발자     4    10
3      대학원     3    14
4       합계    20    50

In [ ]:
# 도수 : 데이터의 빈도수
# 단순하게 도수로만 비교를 한다면 전체 모수가 다를 때 정확한 비교 불가능
# 상대도수

In [17]:
big_per = df_all['빅데도수'] / 20
big_per.name = '빅데상대도수'
big_per

0    0.30
1    0.35
2    0.20
3    0.15
4    1.00
Name: 빅데상대도수, dtype: float64

In [16]:
ai_per = df_all['인공도수'] / 50
ai_per.name = '인공상대도수'
ai_per

0    0.24
1    0.28
2    0.20
3    0.28
4    1.00
Name: 인공상대도수, dtype: float64

In [19]:
all_df = pd.concat([df_all,big_per,ai_per], axis = 1)
all_df

    빅데진로희망  빅데도수  인공도수  빅데상대도수  인공상대도수
0  빅데이터분석가     6    12    0.30    0.24
1      자영업     7    14    0.35    0.28
2     웹개발자     4    10    0.20    0.20
3      대학원     3    14    0.15    0.28
4       합계    20    50    1.00    1.00